app/views/comments/_comment.html.erb

INSERT INTO "comments" ("content", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "teste"], ["created_at", Wed, 19 Jun 2013 22:42:26 BRT -03:00], ["post_id", nil], ["updated_at", Wed, 19 Jun 2013 22:42:26 BRT -03:00], ["user_id", nil]]
---
  <strong><%= comment.user.full_name %></strong>
  <em>on <%= comment.created_at.strftime('%b %d, %Y at %I:%M %p') %></em>