app/views/results/index.html.erb

SELECT "results".* FROM "results" WHERE (user_id = 1 AND match_id IN (6,9,10)) ORDER BY id
---

    $('.edit_result').bind('ajax:success', function(evt, data, status, xhr) {
      //alert(data.message + ' ' + data.result + ' ' + data.result_id);
      //$.find('.alert alert-success').html("errorText");
      if(data.result == 'ok'){
        $('#alertOk').html(data.message);
        $('#alertOk').fadeIn().delay(4000).fadeOut();
        $('#alertError').fadeOut();
      }
      else{
        $('#alertError').html(data.message);
        $('#alertError').fadeIn().delay(4000).fadeOut();
        $('#alertOk').fadeOut();
      }
    });