app/controllers/confirmations_controller.rb

  def show
    user = User.find_by_confirmation_token(params[:token])
---
SELECT "users".* FROM "users" WHERE "users"."confirmation_token" = 'PBhbzoC3AaXPHUfqGC_fSQ' LIMIT 1