app/controllers/general_ranking_controller.rb

  def index
    #Ranking geral dos usuários
    @general_ranking = Array.new

    users = User.all
    users.each do |user|
      @general_ranking << { :user => user, :pointing => Pointing.zero }
    end

    #Obtém todos os palpites onde os jogos já foram encerrados
    results = Result.joins(:match).where('final_result1 IS NOT NULL AND final_result2 IS NOT NULL').includes(:match).order(:user_id)

    #Popula a pontução de cada usuário
    results.each do |result|
---
SELECT "users".* FROM "users"
SELECT "matches".* FROM "matches" WHERE (date >= '2013-06-28 01:09:27.993041') ORDER BY date LIMIT 1