app/controllers/history_matches_controller.rb

SELECT "matches".* FROM "matches" WHERE (date >= '2013-06-20 02:01:11.320959') ORDER BY date LIMIT 1
---
  def index
    @matches = Match.where('date < ?', Time.zone.now).order(:date)

SELECT "results".* FROM "results" INNER JOIN "users" ON "users"."id" = "results"."user_id" WHERE (match_id = '1' AND result1 IS NOT NULL AND result2 IS NOT NULL) ORDER BY full_name
SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT 1  [["id", "1"]]
---
  def preview
    @results = Result.joins(:user).where('match_id = ? AND result1 IS NOT NULL AND result2 IS NOT NULL',
                            params[:id]).order(:full_name)
    @match = Match.find(params[:id])