app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches" WHERE "matches"."group" = 'A' ORDER BY date
---
  def index
    @group_a = Match.where(:group => 'A')