app/controllers/results_controller.rb

SELECT id FROM "matches" WHERE (date >= '2013-06-20 19:00:00.000000' AND date <= '2013-06-21 02:59:59.999999') ORDER BY date
SELECT match_id FROM "results" WHERE (user_id = 1 AND match_id IN (6,9,10))
INSERT INTO "results" ("created_at", "match_id", "result1", "result2", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 19 Jun 2013 21:46:31 BRT -03:00], ["match_id", 6], ["result1", nil], ["result2", nil], ["updated_at", Wed, 19 Jun 2013 21:46:31 BRT -03:00], ["user_id", 1]]
SELECT "results".* FROM "results" WHERE (user_id = 1 AND match_id IN (6,9,10)) ORDER BY id
---
  def index

    #Busca a primeira da data do jogo mais recente a partir da data atual
    match = Match.next_match_of_current_time

    #A partir da data mais próxima, busca os jogos a partir dessa data e horário
    matche_id_of_day = Match.where('date >= ? AND date <= ?', match.date, match.date.end_of_day).order(:date).select(:id).collect(&:id)

    #Busca os match_id existentes no Result
    match_id_exists = Result.where('user_id = ? AND match_id IN (?)', current_user.id, matche_id_of_day).select(:match_id).collect(&:match_id)

    #Subtrai as duas coleções e obtém apenas a diferença
    match_id_not_exists = matche_id_of_day - match_id_exists

    match_id_not_exists.each do |match|
      result = Result.create(:match_id => match, :user_id => current_user.id)
      result.save(:validate => false)
    end

    @results = Result.where('user_id = ? AND match_id IN (?)', current_user.id, matche_id_of_day).order(:id)

SELECT "results".* FROM "results" WHERE "results"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "results" SET "result1" = 2, "result2" = 1, "updated_at" = '2013-06-28 01:38:11.601444' WHERE "results"."id" = 5
---
  def update
    @result = Result.find(params[:id])
    @match = Match.find(@result.match_id)
    respond_to do |format|
      if @result.match.date < Time.zone.now
        format.json { render :json => { :result => "failed",
                                        :message => "Já não há tempo para mais nada amigo!",
                                        :result_id => -1 } }
      else
        if @result.update_attributes(params[:result])