app/controllers/results_controller.rb

  def index
    # antes de fazer a pesquisa, é necessário verificar
    # se o usuário já deu um palpite, nesse caso
    # ele só quer editar o palpite

    #@result = Result.new
    #@result.match = Match.where('final_result1 IS NULL AND final_result2 IS NULL AND date >= ?', DateTime.now).first

    # falta atribui o usuário
    # algo parecido com o que há abaixo:
    # @result.user = current_user

    #respond_with @result

    @all_matches = Match.order(:date)
---
SELECT "matches".* FROM "matches" WHERE (date >= '2013-06-20 00:46:31.813992') ORDER BY date LIMIT 1