app/controllers/rules_controller.rb

  def index
    @rules = Pointing.all
---
SELECT "pointings".* FROM "pointings" WHERE "pointings"."point" = 10 LIMIT 1