app/controllers/users_controller.rb

INSERT INTO "users" ("confirmation_token", "confirmed_at", "created_at", "email", "full_name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if @user.save