app/views/history_matches/index.html.erb

  <script type="text/javascript">
    $(document).ready(function() {

      /*Ativa o style do select*/
      $('select').selectpicker();

      /*$('.btn').bind('ajax:beforeSend', function(evt, data, status, xhr) {
        $('#response_data').html('<center><br><br><br><br><br><br><%= image_tag "loading.gif", :style => "height:40px; width:40px;" %></center>');
      });

      $('.btn').bind('ajax:success', function(evt, data, status, xhr) {
        $('#response_data').html(data);
      });*/

      $('#select_matches').change(function(){
        var url = '<%= url_for :controller => "history_matches", :action => "preview", :id => "" %>';
        var id = $("#select_matches option").filter(":selected").val();

        if(id){
          $.ajax({
            url: url + id,
            dataType: 'html',
---
SELECT "matches".* FROM "matches" WHERE (date < '2013-06-20 02:01:11.070697') ORDER BY date